# -*- coding: utf-8 -*-

from i18n_modern import I18nModern

locales = {
    "新的朋友": "新的朋友",
    "添加朋友": "添加朋友",
    "搜索结果": "搜索结果",
    "找不到相关账号或内容": "找不到相关账号或内容",
    "查看更多消息": "查看更多消息",
    "消息": "消息",
    "表情": "表情",
    "发送文件": "发送文件",
    "截图": "截图",
    "聊天记录": "聊天记录",
    "语音聊天": "语音聊天",
    "视频聊天": "视频聊天",
    "聊天信息": "聊天信息",
    "发送": "发送",
    "置顶": "置顶",
    "最小化": "最小化",
    "最大化": "最大化",
    "关闭": "关闭",
    "以下为新消息": "以下为新消息",
    "会话": "会话",
    "已置顶": "已置顶",
    "文件传输助手": "文件传输助手",
    "发起群聊": "发起群聊",
    "搜索": "搜索",
    "联系人": "联系人",
    "通讯录管理": "通讯录管理",
    "公众号": "公众号",
    "群聊": "群聊",
    "聊天": "聊天",
    "通讯录": "通讯录",
    "收藏": "收藏",
}

i18n = I18nModern("zh_CN")
i18n.load_from_directory("src/wechat-puppeteer/locales/zh_CN")
print(dir(i18n))
print(i18n._locales)
print(i18n.get("取消"))
